Revit 2027 API
SizingCalculator.Friction Method
 Calculates the friction based on the specified parameters.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Friction(
	double flow,
	SizingOptions options
)
Public Function Friction (
	flow As Double,
	options As SizingOptions
) As Double
public:
double Friction(
	double flow,
	SizingOptions^ options
)
member Friction :
        flow : float *
        options : SizingOptions -> float
Parameters
flow Double
 The flow rate.
options SizingOptions
 The sizing options containing other input parameters (such as density, viscosity, roughness, size, etc.).
Return Value
Double
 Returns the calculated friction.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SizingCalculator Class
Autodesk.Revit.DB.Analysis Namespace